In [1]:
import pandas as pd

# 로우 드롭하기

로우 인덱스로 로우를 드롭할 수 있습니다.

In [4]:
friends = [
    {'age': 15, 'job': 'student'},
    {'age': 25, 'job': 'developer'},
    {'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends, 
                  index = ['John', 'Jenny', 'Nate'],
                 columns =['age','job'])

In [5]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

드롭된 결과는 데이터프레임에 저장되지 않습니다. 저장하고 싶으실 경우, 결과를 데이터프레임에 따로 저장하셔야 합니다.

In [6]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [7]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

드롭된 결과를 데이터프레임에 저장하는 예제입니다.

In [8]:
df = df.drop(['John', 'Nate'])

In [9]:
df

       age        job
Jenny   25  developer

### 드롭된 결과를 바로 데이터프레임에 저장하는 방법
inplace 키워드를 사용하시면, 따로 저장할 필요없이, 드롭된 결과가 데이터프레임에 반영됩니다.

In [20]:
df = pd.DataFrame(friends, 
                  index = ['John', 'Jenny', 'Nate'],
                 columns =['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [21]:
df.drop(['John', 'Nate'], inplace = True) # 드럽한 값이 저장됨

In [22]:
df

       age        job
Jenny   25  developer

## 로우 인덱스로 드롭하기

In [24]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, 
                 columns =['name','age','job'])
df  # 인덱스에 숫자가 들어감

   name  age        job
0   NaN   15    student
1   NaN   25  developer
2   NaN   30    teacher

로우 인덱스로 드롭하는 예제입니다.

In [25]:
df = df.drop(df.index[[0,2]])  # 인덱스로 삭제

In [27]:
df

   name  age        job
1   NaN   25  developer

## 컬럼값으로 로우 드롭하기

In [30]:
df = pd.DataFrame(friends, 
                 columns =['name','age','job'])
df # 데이터 복원

   name  age        job
0   NaN   15    student
1   NaN   25  developer
2   NaN   30    teacher

In [31]:
df = df[df.age > 20]  # 조건에 맞는 것을 삭제. 20살 이상인 사람

In [33]:
df

   name  age        job
1   NaN   25  developer
2   NaN   30    teacher

# 컬럼 드롭하기

In [36]:
df = pd.DataFrame(friends, 
                 columns =['name','age','job'])
df

   name  age        job
0   NaN   15    student
1   NaN   25  developer
2   NaN   30    teacher

In [37]:
df = df.drop('age', axis=1)  # axis=1 => 컬럼 중에서 age를 삭제

In [39]:
df

   name        job
0   NaN    student
1   NaN  developer
2   NaN    teacher

In [43]:
df = pd.DataFrame(friends, 
                 columns =['name','age','job'])
df

   name  age        job
0   NaN   15    student
1   NaN   25  developer
2   NaN   30    teacher

In [44]:
df.drop('age', axis=1, inplace = True)

In [45]:
df

   name        job
0   NaN    student
1   NaN  developer
2   NaN    teacher